OpenNuvoton/ISPTool/Firmwares/M058S/Library/Device/Nuvoton/M058S/Include/M058S.h
 * |        |          | Duty ratio = (CMR+1)/(CNR+1).
 * |        |          | CMR >= CNR: PWM output is always high.
 * |        |          | CMR < CNR: PWM low width = (CNR-CMR) unit; PWM high width = (CMR+1) unit.
 * |        |          | CMR = 0: PWM low width = (CNR) unit; PWM high width = 1 unit.
 * |        |          |For Center-aligned type:
 * |        |          | Duty ratio = [(2 x CMR) + 1]/[2 x (CNR+1)].
 * |        |          | CMR > CNR: PWM output is always high.
 * |        |          | CMR <= CNR: PWM low width = 2 x (CNR-CMR) + 1 unit; PWM high width = (2 x CMR) + 1 unit.
 * |        |          | CMR = 0: PWM low width = 2 x CNR + 1 unit; PWM high width = 1 unit.
 * |        |          |(Unit = one PWM clock cycle).
 * |        |          |Note: Any write to CMR will take effect in next PWM cycle.
 * @var PWM_T::PDR3
 * Offset: 0x38  PWM Data Register 3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |PDR       |PWM Data Register
 * |        |          |User can monitor PDR to know the current value in 16-bit down counter.
 * @var PWM_T::PIER
 * Offset: 0x40  PWM Interrupt Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWMIE0    |PWM Channel 0 Period Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[1]     |PWMIE1    |PWM Channel 1 Period Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[2]     |PWMIE2    |PWM Channel 2 Period Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[3]     |PWMIE3    |PWM Channel 3 Period Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[8]     |PWMDIE0   |PWM Channel 0 Duty Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[9]     |PWMDIE1   |PWM Channel 1 Duty Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[10]    |PWMDIE2   |PWM Channel 2 Duty Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[11]    |PWMDIE3   |PWM Channel 3 Duty Interrupt Enable
 * |        |          |0 = Disabled.
 * |        |          |1 = Enabled.
 * |[16]    |INT01TYPE |PWM01 Interrupt Period Type Selection
 * |        |          |0 = PWMIFx will be set if PWM counter underflow.
 * |        |          |PWM will trigger ADC to conversion when PWM counter underflow if correlate PWM trigger enable bit (PWMxTEN) is set to 1.
 * |        |          |1 = PWMIFx will be set if PWM counter matches CNRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter matches CNRx register if correlate PWM trigger enable bit (PWMxTEN) is set to 1.
 * |        |          |Note: Setting INT01TYPE to 1 only works when PWM operating is in center-aligned type.
 * |[17]    |INT23TYPE |PWM23 Interrupt Period Type Selection
 * |        |          |0 = PWMIFx will be set if PWM counter underflow.
 * |        |          |PWM will trigger ADC to conversion when PWM counter underflow if correlate PWM trigger enable bit (PWMxTEN) is set to 1.
 * |        |          |1 = PWMIFx will be set if PWM counter matches CNRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter matches CNRx register if correlate PWM trigger enable bit (PWMxTEN) is set to 1.
 * |        |          |Note: Setting INT23TYPE to 1 only works when PWM operating is in center-aligned type.
 * |[24]    |INT01DTYPE|PWM01 Duty Interrupt Type Selection
 * |        |          |0 = PWMDIFx will be set if PWM counter down count and matches CMRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter down count and matches CMRx register if correlate PWM trigger enable bit (PWMxDTEN) is set to 1.
 * |        |          |1 = PWMDIFx will be set when PWM counter up count and matches CMRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter up count and matches CMRx register if correlate PWM trigger enable bit (PWMxDTEN) is set to 1.
 * |        |          |Note: Set INT01DTYPE to 1 only work when PWM operating in center aligned type.
 * |[25]    |INT23DTYPE|PWM23 Duty Interrupt Type Selection
 * |        |          |0 = PWMDIFx will be set if PWM counter down count and matches CMRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter down count and matches CMRx register if correlate PWM trigger enable bit (PWMxDTEN) is set to 1.
 * |        |          |1 = PWMDIFx will be set when PWM counter up count and matches CMRx register.
 * |        |          |PWM will trigger ADC to conversion when PWM counter up count and matches CMRx register if correlate PWM trigger enable bit (PWMxDTEN) is set to 1.
 * |        |          |Note: Set INT23DTYPE to 1 only work when PWM operating in center aligned type.
 * @var PWM_T::PIIR
 * Offset: 0x44  PWM Interrupt Indication Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWMIF0    |PWM channel 0 Period Interrupt Status
 * |        |          |When INTTYPE01 = 0, this bit is set by hardware when channel 0 PWM counter equals 0.
 * |        |          |When INTTYPE01 = 1, this bit is set by hardware when channel 0 PWM counter equals CNR0.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[1]     |PWMIF1    |PWM channel 1 Period Interrupt Status
 * |        |          |When INTTYPE01 = 0, this bit is set by hardware when channel 1 PWM counter equals 0.
 * |        |          |When INTTYPE01 = 1, this bit is set by hardware when channel 1 PWM counter equals CNR1.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[2]     |PWMIF2    |PWM channel 2 Period Interrupt Status
 * |        |          |When INTTYPE23 = 0, this bit is set by hardware when channel 2 PWM counter equals 0.
 * |        |          |When INTTYPE23 = 1, this bit is set by hardware when channel 2 PWM counter equals CNR2.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[3]     |PWMIF3    |PWM Channel 3 Period Interrupt Status
 * |        |          |When INTTYPE23 = 0, this bit is set by hardware when channel 3 PWM counter equals 0.
 * |        |          |When INTTYPE23 = 1, this bit is set by hardware when channel 3 PWM counter equals CNR3.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[8]     |PWMDIF0   |PWM Channel 0 Duty Interrupt Status
 * |        |          |When INTDTYPE01 = 0, this bit is set by hardware when channel 0 PWM counter equals CMR0 on down-count.
 * |        |          |When INTDTYPE01 = 1, this bit is set by hardware when channel 0 PWM counter equals CMR0 on up-count.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[9]     |PWMDIF1   |PWM Channel 1 Duty Interrupt Status
 * |        |          |When INTDTYPE01 = 0, this bit is set by hardware when channel 1 PWM counter equals CMR1 on down-count.
 * |        |          |When INTDTYPE01 = 1, this bit is set by hardware when channel 1 PWM counter equals CMR1 on up-count.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[10]    |PWMDIF2   |PWM Channel 2 Duty Interrupt Status
 * |        |          |When INTDTYPE23 = 0, this bit is set by hardware when channel 2 PWM counter equals CMR2 on down-count.
 * |        |          |When INTDTYPE23 = 1, this bit is set by hardware when channel 2 PWM counter equals CMR2 on up-count.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[11]    |PWMDIF3   |PWM Channel 3 Duty Interrupt Status
 * |        |          |When INTDTYPE23 = 0, this bit is set by hardware when channel 3 PWM counter equals CMR3 on down-count.
 * |        |          |When INTDTYPE23 = 1, this bit is set by hardware when channel 3 PWM counter equals CMR3 on up-count.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * @var PWM_T::CCR0
 * Offset: 0x50  PWM Capture Control Register 0
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INV0      |Capture Channel 0 Inverter Enable Control
 * |        |          |0 = Inverter Disabled.
 * |        |          |1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer.
 * |[1]     |CRL_IE0   |Channel 0 Rising Latch Interrupt Enable Control
 * |        |          |0 = Rising latch interrupt Disabled.
 * |        |          |1 = Rising latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 0 has rising transition, Capture will issue an Interrupt.
 * |[2]     |CFL_IE0   |Channel 0 Falling Latch Interrupt Enable Control
 * |        |          |0 = Falling latch interrupt Disabled.
 * |        |          |1 = Falling latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 0 has falling transition, and Capture will issue an Interrupt.
 * |[3]     |CAPCH0EN  |Channel 0 Capture Function Enable Control
 * |        |          |0 = Capture function on PWM group channel 0 Disabled.
 * |        |          |1 = Capture function on PWM group channel 0 Enabled.
 * |        |          |Note1: When Enabled, Capture latches the PWM-counter value and saved to CRLR (Rising latch) and CFLR (Falling latch).
 * |        |          |Note2: When Disabled, Capture does not update CRLR and CFLR, and disable PWM group channel 0 Interrupt.
 * |[4]     |CAPIF0    |Channel 0 Capture Interrupt Indication Flag
 * |        |          |If PWM group channel 0 rising latch interrupt is enabled (CRL_IE0 = 1), a rising transition occurs at PWM group channel 0 will result in CAPIF0 to high;
 * |        |          |Similarly, a falling transition will cause CAPIF0 to be set high if PWM group channel 0 falling latch interrupt is enabled (CFL_IE0 = 1).
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[6]     |CRLRI0    |CRLR0 Latched Indicator
 * |        |          |When PWM group input channel 0 has a rising transition, CRLR0 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note:  Write 1 to clear this bit to 0.
 * |[7]     |CFLRI0    |CFLR0 Latched Indicator
 * |        |          |When PWM group input channel 0 has a falling transition, CFLR0 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[16]    |INV1      |Capture Channel 1 Inverter Enable Control
 * |        |          |0 = Inverter Disabled.
 * |        |          |1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer.
 * |[17]    |CRL_IE1   |Channel 1 Rising Latch Interrupt Enable Control
 * |        |          |0 = Rising latch interrupt Disabled.
 * |        |          |1 = Rising latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 1 has rising transition, Capture will issue an Interrupt.
 * |[18]    |CFL_IE1   |Channel 1 Falling Latch Interrupt Enable Control
 * |        |          |0 = Falling latch interrupt Disabled.
 * |        |          |1 = Falling latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 1 has falling transition, Capture will issue an Interrupt.
 * |[19]    |CAPCH1EN  |Channel 1 Capture Function Enable Control
 * |        |          |0 = Capture function on PWM group channel 1 Disabled.
 * |        |          |1 = Capture function on PWM group channel 1 Enabled.
 * |        |          |Note1: When Enabled, Capture latched the PWM-counter and saved to CRLR (Rising latch) and CFLR (Falling latch).
 * |        |          |Note2: When Disabled, Capture does not update CRLR and CFLR, and disable PWM group channel 1 Interrupt.
 * |[20]    |CAPIF1    |Channel 1 Capture Interrupt Indication Flag
 * |        |          |If PWM group channel 1 rising latch interrupt is enabled (CRL_IE1 = 1), a rising transition occurs at PWM group channel 1 will result in CAPIF1 to high;
 * |        |          |Similarly, a falling transition will cause CAPIF1 to be set high if PWM group channel 1 falling latch interrupt is enabled (CFL_IE1 = 1).
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[22]    |CRLRI1    |CRLR1 Latched Indicator
 * |        |          |When PWM group input channel 1 has a rising transition, CRLR1 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[23]    |CFLRI1    |CFLR1 Latched Indicator
 * |        |          |When PWM group input channel 1 has a falling transition, CFLR1 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * @var PWM_T::CCR2
 * Offset: 0x54  PWM Capture Control Register 2
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |INV2      |Capture Channel 2 Inverter Enable Control
 * |        |          |0 = Inverter Disabled.
 * |        |          |1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer.
 * |[1]     |CRL_IE2   |Channel 2 Rising Latch Interrupt Enable Control
 * |        |          |0 = Rising latch interrupt Disabled.
 * |        |          |1 = Rising latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 2 has rising transition, Capture will issue an Interrupt.
 * |[2]     |CFL_IE2   |Channel 2 Falling Latch Interrupt Enable Control
 * |        |          |0 = Falling latch interrupt Disabled.
 * |        |          |1 = Falling latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 2 has falling transition, Capture will issue an Interrupt.
 * |[3]     |CAPCH2EN  |Channel 2 Capture Function Enable Control
 * |        |          |0 = Capture function on PWM group channel 2 Disabled.
 * |        |          |1 = Capture function on PWM group channel 2 Enabled.
 * |        |          |Note1: When Enabled, Capture latched the PWM-counter value and saved to CRLR (Rising latch) and CFLR (Falling latch).
 * |        |          |Note2: When Disabled, Capture does not update CRLR and CFLR, and disable PWM group channel 2 Interrupt.
 * |[4]     |CAPIF2    |Channel 2 Capture Interrupt Indication Flag
 * |        |          |If PWM group channel 2 rising latch interrupt is enabled (CRL_IE2=1), a rising transition occurs at PWM group channel 2 will result in CAPIF2 to high;
 * |        |          |Similarly, a falling transition will cause CAPIF2 to be set high if PWM group channel 2 falling latch interrupt is enabled (CFL_IE2=1).
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[6]     |CRLRI2    |CRLR2 Latched Indicator
 * |        |          |When PWM group input channel 2 has a rising transition, CRLR2 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[7]     |CFLRI2    |CFLR2 Latched Indicator
 * |        |          |When PWM group input channel 2 has a falling transition, CFLR2 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[16]    |INV3      |Capture Channel 3 Inverter Enable Control
 * |        |          |0 = Inverter Disabled.
 * |        |          |1 = Inverter Enabled. Reverse the input signal from GPIO before fed to Capture timer.
 * |[17]    |CRL_IE3   |Channel 3 Rising Latch Interrupt Enable Control
 * |        |          |0 = Rising latch interrupt Disabled.
 * |        |          |1 = Rising latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 3 has rising transition, Capture will issue an Interrupt.
 * |[18]    |CFL_IE3   |Channel 3 Falling Latch Interrupt Enable Control
 * |        |          |0 = Falling latch interrupt Disabled.
 * |        |          |1 = Falling latch interrupt Enabled.
 * |        |          |Note: When Enabled, if Capture detects PWM group channel 3 has falling transition, Capture will issue an Interrupt.
 * |[19]    |CAPCH3EN  |Channel 3 Capture Function Enable Control
 * |        |          |0 = Capture function on PWM group channel 3 Disabled.
 * |        |          |1 = Capture function on PWM group channel 3 Enabled.
 * |        |          |Note1: When Enabled, Capture latched the PWM-counter and saved to CRLR (Rising latch) and CFLR (Falling latch).
 * |        |          |Note2: When Disabled, Capture does not update CRLR and CFLR, and disable PWM group channel 3 Interrupt.
 * |[20]    |CAPIF3    |Channel 3 Capture Interrupt Indication Flag
 * |        |          |If PWM group channel 3 rising latch interrupt is enabled (CRL_IE3=1), a rising transition occurs at PWM group channel 3 will result in CAPIF3 to high;
 * |        |          |Similarly, a falling transition will cause CAPIF3 to be set high if PWM group channel 3 falling latch interrupt is enabled (CFL_IE3=1).
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[22]    |CRLRI3    |CRLR3 Latched Indicator
 * |        |          |When PWM group input channel 3 has a rising transition, CRLR3 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * |[23]    |CFLRI3    |CFLR3 Latched Indicator
 * |        |          |When PWM group input channel 3 has a falling transition, CFLR3 was latched with the
 * |        |          |value of PWM down-counter and this bit is set by hardware.
 * |        |          |Note: Write 1 to clear this bit to 0.
 * @var PWM_T::CRLR0
 * Offset: 0x58  PWM Capture Rising Latch Register (Channel 0)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter value when Channel 0 has rising transition.
 * @var PWM_T::CFLR0
 * Offset: 0x5C  PWM Capture Falling Latch Register (Channel 0)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter value when Channel 0 has Falling transition.
 * @var PWM_T::CRLR1
 * Offset: 0x60  PWM Capture Rising Latch Register (Channel 1)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter value when Channel 1 has rising transition.
 * @var PWM_T::CFLR1
 * Offset: 0x64  PWM Capture Falling Latch Register (Channel 1)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter value when Channel 1 has Falling transition.
 * @var PWM_T::CRLR2
 * Offset: 0x68  PWM Capture Rising Latch Register (Channel 2)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter value when Channel 2 has rising transition.
 * @var PWM_T::CFLR2
 * Offset: 0x6C  PWM Capture Falling Latch Register (Channel 2)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter value when Channel 2 has Falling transition.
 * @var PWM_T::CRLR3
 * Offset: 0x70  PWM Capture Rising Latch Register (Channel 3)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CRLR      |Capture Rising Latch Register
 * |        |          |Latch the PWM counter value when Channel 3 has rising transition.
 * @var PWM_T::CFLR3
 * Offset: 0x74  PWM Capture Falling Latch Register (Channel 3)
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[15:0]  |CFLR      |Capture Falling Latch Register
 * |        |          |Latch the PWM counter value when Channel 3 has Falling transition.
 * @var PWM_T::CAPENR
 * Offset: 0x78  PWM Capture Input 0~3 Enable Register
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[3:0]   |CAPENR    |Capture Input Enable Register
 * |        |          |0 = Capture input Disabled. (PWMx multi-function pin input does not affect input capture function.)
 * |        |          |1 = Capture input Enabled. (PWMx multi-function pin input will affect its input capture function.)
 * |        |          |CAPENR
 * |        |          |Bit 3210 for PWM group A
 * |        |          |Bit xxx1 -> Capture channel 0 enabled. Capture input channel can be from P2.0 or
 * |        |          |P4.0. User can only select one of pins by setting multi-function pin register.
 * |        |          |Bit xx1x -> Capture channel 1 enabled. Capture input channel can be from P2.1 or
 * |        |          |P4.1. User can only select one of pins by setting multi-function pin register.
 * |        |          |Bit x1xx -> Capture channel 2 enabled. Capture input channel can be from P2.2 or
 * |        |          |P4.2. User can only select one of pins by setting multi-function pin register.
 * |        |          |Bit 1xxx -> Capture channel 3 enabled. Capture input channel can be from P2.3 or
 * |        |          |P4.3. User can only select one of pins by setting multi-function pin register.
 * @var PWM_T::POE
 * Offset: 0x7C  PWM Output Enable Register for Channel 0~3
 * ---------------------------------------------------------------------------------------------------
 * |Bits    |Field     |Descriptions
 * | :----: | :----:   | :---- |
 * |[0]     |PWM0      |PWM Channel 0 Output Enable Register
 * |        |          |0 = PWM channel 0 output to pin Disabled.
 * |        |          |1 = PWM channel 0 output to pin Enabled.
 * |        |          |Note: The corresponding GPIO pin must also be switched to PWM function.
 * |[1]     |PWM1      |PWM Channel 1 Output Enable Register
 * |        |          |0 = PWM channel 1 output to pin Disabled.
